In [1]:
import os
import json
import psycopg2
from psycopg2.extras import DictCursor

POSTGRESQL_HOST = '10.129.0.25'

In [2]:
%load_ext sql

In [3]:
!env | grep POST

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [4]:
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [5]:
%sql $CONNECT_DATA

(1)

Which fare conditions are available for flights from AER to SVO (i.e. from Adler/Sochi to Sheremetevo/Moscow)

In [6]:
%%sql
SELECT distinct fare_conditions
FROM ticket_flights
WHERE flight_id in(
    SELECT flight_id
    FROM flights
    WHERE departure_airport='AER' and arrival_airport='SVO'
);

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

(2)

A list of aircraft models which fly to the Yakutsk AND Abakan cities

In [7]:
%%sql
SELECT distinct model
FROM aircrafts
WHERE aircraft_code in (
    SELECT aircraft_code
    FROM flights
    WHERE arrival_airport in (
        SELECT airport_code
        FROM airports
        WHERE city='Yakutsk'
    )
    INTERSECT SELECT aircraft_code
    FROM flights
    WHERE arrival_airport IN (
        SELECT airport_code
        FROM airports
        WHERE city = 'Abakan'
    )
);

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('Airbus A319-100',)]

(3)

A list of aircraft models which fly to the Yakutsk OR Abakan cities

In [8]:
%%sql
SELECT distinct model
FROM aircrafts
WHERE aircraft_code in (
    SELECT aircraft_code
    FROM flights
    WHERE arrival_airport in (
        SELECT airport_code
        FROM airports
        WHERE city='Yakutsk' or city = 'Abakan'
    )
);

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Airbus A319-100',),
 ('Boeing 737-300',),
 ('Bombardier CRJ-200',),
 ('Cessna 208 Caravan',),
 ('Sukhoi Superjet-100',)]

(4)

A list of aircrafts which DONâ€™T fly to Yakutsk city

In [9]:
%%sql
SELECT distinct model, aircraft_code
FROM aircrafts
WHERE aircraft_code not in (
    SELECT aircraft_code
    FROM flights
    WHERE arrival_airport in (
        SELECT airport_code
        FROM airports
        WHERE city='Yakutsk'
    )
);

 * postgresql://reader:***@10.129.0.25/demo
6 rows affected.

[('Airbus A320-200', '320'),
 ('Airbus A321-200', '321'),
 ('Boeing 737-300', '733'),
 ('Boeing 767-300', '763'),
 ('Boeing 777-300', '773'),
 ('Cessna 208 Caravan', 'CN1')]

(5)

Find out airport codes related to Mrs. 'ELLA DMITRIEVA'  - from where and to where she flew.

In [10]:
%%sql
SELECT distinct departure_airport, arrival_airport
FROM flights
WHERE flight_id in(
    SELECT flight_id
    FROM ticket_flights
    WHERE ticket_no in (
        SELECT ticket_no
        FROM tickets
        WHERE passenger_name='ELLA DMITRIEVA'
    )
);

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME'),
 ('MQF', 'SVX'),
 ('SVO', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO')]